Revit 2026 API

# ScheduleDefinitionSetFilters Method

---
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetFilters(
	IList<ScheduleFilter> filters
)
```
```vb
Public Sub SetFilters (
	filters As IList(Of ScheduleFilter)
)
```
```cpp
public:
void SetFilters(
	IList<ScheduleFilter^>^ filters
)
```
```fsharp
member SetFilters :
        filters : IList<ScheduleFilter> -> unit
```

#### Parameters

filters IListScheduleFilter

#### Reference

ScheduleDefinition Class

Autodesk.Revit.DB Namespace